{
  "recipes": {
    "Homemade Gyros": {
      "title": "Homemade Gyros",
      "ing": "For the Meat Mixture: 1 pound ground lamb (or beef), 1/4 cup red onion (minced), 2 cloves garlic (minced), 2 teaspoon salt, 1 teaspoon black pepper, 1 1/2 teaspoon cumin, 1/4 teaspoon nutmeg, 1 teaspoon dried oregano, 2 teaspoon fresh lemon juice, \nFor the Sandwich: 4 rounds flatbread (or pita),1 leaf of lettuce,1 tomato (sliced), 1 onion (sliced), Tzatziki sauce",
      "inst": "To Make the Meat Mixture: \n1.) The first step in making any gyro is to prepare the meat. It is very easy and should take just a few minutes, though you will need to let it marinade for an hour, so plan ahead.\n2.) Gather the ingredients.\n3.) Thoroughly combine all the ingredients in a bowl.\n4.) Divide into four equal portions and shape into oblong patties about 3-inch wide by 6-inch long by 1/2-inch thick. Notice that the patty is shaped more like a sausage - long and thin - rather than a hamburger patty. This is intentional, to ensure the patty fits in the flatbread.\n5.) Refrigerate for one hour.\n\nTo Build the Sandwich\n1.) You can grill the patties on your outdoor grill or fry them up in a pan on the stove. The goal is to have crisp edges on the patty.\n2.) Also, the toppings that go into a traditional gyro are simple: tzatziki, lettuce, tomato, and onion. If you prefer, you can skip the onion because there are already onions in the meat.\n3.) Grill the patties over high heat for 3 to 4 minutes per side.\n4.) Spread tzatziki sauce down the center of a flatbread round or in the pocket of the pita.\n5.) Add a lettuce leaf, some diced tomato, and a few thin onion slices.\n6.) Add the patty and fold the bread over the lamb, if using a flatbread. If using a pita, put the patty inside the pita pocket.\n7.) Enjoy!"
    },
    "To Die For Fettuccine Alfredo ": {
      "title": "To Die For Fettuccine Alfredo ",
      "ing": "24 ounces dry fettuccini pasta1 cup butter, 3/4 pint heavy cream, salt and pepper to taste,1 dash garlic salt, 3/4 cup grated Romano cheese, 1/2 cup grated Parmesan cheese",
      "inst": "1.) Bring a large pot of lightly salted water to a boil. Add fettuccini and cook for 8 to 10 minutes or until al dente; drain.\n2.) In a large saucepan, melt butter into cream over low heat. Add salt, pepper and garlic salt. Stir in cheese over medium heat until melted; this will thicken the sauce.\n3.) Add pasta to sauce. Use enough of the pasta so that all of the sauce is used and the pasta is thoroughly coated. Serve immediately."
    },
    "Twice Cooked Pork": {
      "title": "Twice Cooked Pork",
      "ing": "300 g pork belly, 1 green onion, 4-5 Sichuan peppercorn , optional 1 small bunch garlic sprout, 2 long red chili peppers,1 teaspoon cooking oil, 1 inch scallion stalk, 1/2 thumb ginger, 2 garlic cloves, 1 tablespoon broad bean paste: (doubanjiang), 2 teaspoon dou-chi: fermented black beans,1 teaspoons light soy sauce",
      "inst": "1.) Place pork belly in a large pot with enough cold water to cover. Add 1 green onion and 4-5 Sichuan peppercorn seeds. Bring to boil and simmer for 30 minutes. If you are cooking a larger amount, cut the pork belly into sections around 15 cm long (keeping note 1) Transfer out and set aside to cool down.\n2.) Smash the head of garlic sprouts and then cut the head part and leaves into 1.5 inch sections. Remove the seeds of red pepper and cut into pieces too.\n3.) Heat up around 1 teaspoon of oil in wok (not too much, otherwise the dish might be over greasy), fry the pork belly for around 1-2 minutes (Note 2)until they begin to loose oil and slightly brown.\n4.) Move the pork slices out and leave oil only, fry ginger, garlic and scallion until aroma. Place doubanjiang and dou-chi, fry for another half minute. Return pork slices and give a big stir fry to combine well.\n5.) Add red pepper, fry for another half minutes. Lastly, place garlic spouts and light soy sauce. Combine well and transfer out immediately.\n6.) Serve with steamed rice."
    },
    "Shanghai\\-Style Braised Pork Belly \\(Hong Shao Rou\\)": {
      "title": "Shanghai-Style Braised Pork Belly (Hong Shao Rou)",
      "ing": "1/4 lb. of lean pork belly, 2 tablespoons oil, 1 tablespoon sugar (rock sugar is preferred if you have it), 3 tablespoons shaoxing wine, 1 tablespoon regularsoy sauce, ½ tablespoon dark soy sauce, 2 cups water",
      "inst": "1.\tStart by cutting your pork belly into 3/4-inch thick pieces.\n2.\tBring a pot of water to a boil. Blanch the pork belly pieces for a couple minutes. This gets rid of impurities and starts the cooking process. Take the pork out of the pot, rinse, and set aside.\n3.\tOver low heat, add the oil and sugar to your wok. Melt the sugar slightly and add the pork. Raise the heat to medium and cook until the pork is lightly browned.\n4.\tTurn the heat back down to low and add shaoxing cooking wine, regular soy sauce, dark soy sauce, and water.\n5.\tNOTE: It’s very important to the color and flavor of this dish that you have both kinds of soy sauce! Just head to your local Asian market, buy a bottle of each, and it will last you a year!\n6.\tCover and simmer for about 45 minutes to 1 hour until pork is fork tender. Every 5-10 minutes, stir to prevent burning and add more water if it gets too dry.\n7.\tOnce the pork is fork tender, if there is still a lot of visible liquid, uncover the wok, turn up the heat, and stir continuously until the sauce has reduced to a glistening coating.\n"
    },
    "Pastitsio \\(Greek Lasagna\\)": {
      "title": "Pastitsio (Greek Lasagna)",
      "ing": "BECHAMEL SAUCE: 6 tablespoons unsalted butter, 3/4 cup all-purpose flour, 1 quart whole milk, warmed until hot, 1 1/2 teaspoons salt, 3 large eggs\nMAIN DISH: 4 tablespoons unsalted butter, 2 medium onions, chopped, 2 pounds 90% lean ground beef, 1/8 teaspoon ground cinnamon, salt and pepper, to taste, 1/2 cup water, 2 tablespoons tomato paste, 1 pound ziti pasta, 3 large eggs, beaten, 1 1/2 teaspoons salt, 12 to 16 ounces Kasseri or Kefalotiri cheese, grated (see notes below)\n",
      "inst": "PREPARE THE BECHAMEL SAUCE:\n1.\tMelt the butter in a medium saucepan. Whisk in the flour and then gradually whisk in the hot milk. Cook, whisking constantly, until the sauce is smooth and thickened. Stir in the salt, remove from heat and let cool. When the sauce is lukewarm, whisk in the eggs. Set aside.\nPREPARE THE MEAT LAYER:\n1.\tMelt 4 tablespoons butter in a large skillet. Add the onions and saute until softened and golden. Crumble the beef into the skillet and cook with the onions until the beef is browned. Stir in the cinnamon, salt and pepper. Stir in the water and tomato paste, and simmer for 5 minutes. Set aside.\nPREPARE THE PASTA LAYER:\n1.\tCook ziti according to directions on the package. Drain and rinse with cool water. When pasta has cooled down, stir in the beaten eggs and 1 1/2 teaspoons salt.\nASSEMBLE THE DISH:\n1.\tPreheat your oven to 350 degrees F. Spray a deep 9x13-inch casserole dish with nonstick spray. You really need a deep casserole dish for this recipe (deeper than the usual 9x13-inch pyrex).\n2.\tScoop half of the pasta into the bottom of your prepared dish. Sprinkle generously with cheese. Spoon on the meat mixture to create an even layer; sprinkle with another layer of cheese. Scoop the remaining pasta on top of the meat and sprinkle with more cheese! Top with the cream sauce and sprinkle with the remaining cheese.\n3.\tBake 45 minutes, or until the sauce is bubbly and golden on top. Let sit at room temperature for at least 20 minutes before serving (but it is suggested that you refrigerate to let the layers set... and then warm up later to serve).\n"
    },
    "Lemon Pepper Chicken": {
      "title": "Lemon Pepper Chicken",
      "ing": "1/2 c. all-purpose flour, 1 tbsp. lemon pepper seasoning, 1 tsp. kosher salt, 2 lemons, divided, 1 lb. boneless skinless chicken breasts, halved, 2 tbsp. extra-virgin olive oil, 1/2 c. Chicken broth, 2 tbsp. butter, 2 cloves garlic, minced, Freshly chopped parsley, for garnish",
      "inst": "1.\tPreheat oven to 400°. In a medium bowl, whisk together flour, lemon pepper, salt, and zest of 1 lemon. Toss chicken breasts in the flour mixture until fully coated. Slice remaining lemon into thin rounds.\n2.\tIn a large ovenproof skillet over medium-high heat, heat oil. Add chicken in a single layer and cook until golden on bottom, about 5 minutes, then flip chicken breasts.\n3.\tTo skillet, add broth, butter, garlic, and lemon slices and bake until chicken is cooked through and sauce has reduced slightly, 15 minutes.\n4.\tSpoon sauce on top of chicken and garnish with parsley."
    },
    "Mimosas": {
      "title": "Mimosas",
      "ing": "1 bottle (750 mL) chilled Cava or Prosecco, 2 to 4 cups chilled pulp-free orange juice",
      "inst": "1.)\tWhile holding your Champagne flute at a slight tilt, fill the glass about halfway with sparkling wine.\n2.)\tFill the rest of the glass with orange juice, and serve promptly. Feel free to adjust the ratio of sparkling wine to orange juice to suit your preferences (I like my mimosas with more sparkling wine than orange juice).\n"
    },
    "Apple Pie": {
      "title": "Apple Pie",
      "ing": "apple",
      "inst": "try it "
    }
  }
}