{
  "recipes": {
    "Homemade Gyros": {
      "title": "Homemade Gyros",
      "ing": "For the Meat Mixture: 1 pound ground lamb (or beef), 1/4 cup red onion (minced), 2 cloves garlic (minced), 2 teaspoon salt, 1 teaspoon black pepper, 1 1/2 teaspoon cumin, 1/4 teaspoon nutmeg, 1 teaspoon dried oregano, 2 teaspoon fresh lemon juice, \nFor the Sandwich: 4 rounds flatbread (or pita),1 leaf of lettuce,1 tomato (sliced), 1 onion (sliced), Tzatziki sauce",
      "inst": "To Make the Meat Mixture: \n1.) The first step in making any gyro is to prepare the meat. It is very easy and should take just a few minutes, though you will need to let it marinade for an hour, so plan ahead.\n2.) Gather the ingredients.\n3.) Thoroughly combine all the ingredients in a bowl.\n4.) Divide into four equal portions and shape into oblong patties about 3-inch wide by 6-inch long by 1/2-inch thick. Notice that the patty is shaped more like a sausage - long and thin - rather than a hamburger patty. This is intentional, to ensure the patty fits in the flatbread.\n5.) Refrigerate for one hour.\n\nTo Build the Sandwich\n1.) You can grill the patties on your outdoor grill or fry them up in a pan on the stove. The goal is to have crisp edges on the patty.\n2.) Also, the toppings that go into a traditional gyro are simple: tzatziki, lettuce, tomato, and onion. If you prefer, you can skip the onion because there are already onions in the meat.\n3.) Grill the patties over high heat for 3 to 4 minutes per side.\n4.) Spread tzatziki sauce down the center of a flatbread round or in the pocket of the pita.\n5.) Add a lettuce leaf, some diced tomato, and a few thin onion slices.\n6.) Add the patty and fold the bread over the lamb, if using a flatbread. If using a pita, put the patty inside the pita pocket.\n7.) Enjoy!"
    },
    "To Die For Fettuccine Alfredo ": {
      "title": "To Die For Fettuccine Alfredo ",
      "ing": "24 ounces dry fettuccini pasta1 cup butter, 3/4 pint heavy cream, salt and pepper to taste,1 dash garlic salt, 3/4 cup grated Romano cheese, 1/2 cup grated Parmesan cheese",
      "inst": "1.) Bring a large pot of lightly salted water to a boil. Add fettuccini and cook for 8 to 10 minutes or until al dente; drain.\n2.) In a large saucepan, melt butter into cream over low heat. Add salt, pepper and garlic salt. Stir in cheese over medium heat until melted; this will thicken the sauce.\n3.) Add pasta to sauce. Use enough of the pasta so that all of the sauce is used and the pasta is thoroughly coated. Serve immediately."
    },
    "Twice Cooked Pork": {
      "title": "Twice Cooked Pork",
      "ing": "300 g pork belly, 1 green onion, 4-5 Sichuan peppercorn , optional 1 small bunch garlic sprout, 2 long red chili peppers,1 teaspoon cooking oil, 1 inch scallion stalk, 1/2 thumb ginger, 2 garlic cloves, 1 tablespoon broad bean paste: (doubanjiang), 2 teaspoon dou-chi: fermented black beans,1 teaspoons light soy sauce",
      "inst": "1.) Place pork belly in a large pot with enough cold water to cover. Add 1 green onion and 4-5 Sichuan peppercorn seeds. Bring to boil and simmer for 30 minutes. If you are cooking a larger amount, cut the pork belly into sections around 15 cm long (keeping note 1) Transfer out and set aside to cool down.\n2.) Smash the head of garlic sprouts and then cut the head part and leaves into 1.5 inch sections. Remove the seeds of red pepper and cut into pieces too.\n3.) Heat up around 1 teaspoon of oil in wok (not too much, otherwise the dish might be over greasy), fry the pork belly for around 1-2 minutes (Note 2)until they begin to loose oil and slightly brown.\n4.) Move the pork slices out and leave oil only, fry ginger, garlic and scallion until aroma. Place doubanjiang and dou-chi, fry for another half minute. Return pork slices and give a big stir fry to combine well.\n5.) Add red pepper, fry for another half minutes. Lastly, place garlic spouts and light soy sauce. Combine well and transfer out immediately.\n6.) Serve with steamed rice."
    }
  }
}